AUTS_server/app/controllers/signin_controller.rb

  def create
    user = User.find_by(email: params[:email_login]) || User.find_by(login: params[:email_login])
---
SELECT "users".* FROM "users" WHERE "users"."login" = $1 LIMIT $2  [["login", "Teacher_Test"], ["LIMIT", 1]]